<?php

namespace App\Http\Controllers\Students;

use App\Http\Controllers\Controller;
use Illuminate\Http\Request;
use App\Models\Student;

class TestController extends Controller
{
    public function index()
    {
        $tests = array(
            array(
                array(
                    'question' => '“Янги Ўзбекистон” деганда нимани тушунасиз?',
                    'options' => array(
                        'Мамлакатимизнинг замонавий қиёфасини шакллантириш, юртимизда демократик давлат, эркин фуқаролик жамиятини барпо этиш, Учинчи Ренессанс пойдеворини яратиш борасидаги ислоҳотларимизнинг таянч ғоясини ифода этади.',
                        'Юртимизда демократик давлат, эркин фуқаролик жамиятини барпо этиш, Учинчи Ренессанс пойдеворини яратиш борасидаги ислоҳотларимизнинг таянч ғоясини ифода этади.',
                        'Мамлакатимизнинг замонавий қиёфасини шакллантириш, Учинчи Ренессанс пойдеворини яратиш борасидаги ислоҳотларимизнинг таянч ғоясини ифода этади.',
                        'Мамлакатимизнинг замонавий қиёфасини шакллантириш, юртимизда демократик давлат, эркин фуқаролик жамиятини барпо этиш борасидаги ислоҳотларимизнинг таянч ғоясини ифода этади.'
                    )
                ),
                array(
                    'question' => 'Ўзбекистон Республикаси Олий Мажлиси неча палатадан иборат?',
                    'options' => array(
                        'Иккита: Қонунчилик палатаси ва Сенат',
                        'Учта: Олий Мажлис, Қонунчилик палатаси ва Сенат',
                        'Битта',
                        'Тўғри жавоб берилмаган'
                    )
                ),
                array(
                    'question' => 'Ўзбекистон Республикаси Қуролли Кучлари қандай мақсадда тузилган?',
                    'options' => array(
                        'Қуролли Кучлар давлат ҳарбий ташкилотининг ва мамлакат мудофаа тизимининг негизи бўлиб, ҳарбий можароларни жиловлаш ҳамда уларнинг олдини олиш, шунингдек давлатнинг ҳарбий хавфсизлигини таъминлаш учун мўлжалланган.',
                        'Қуролли Кучлар давлат ҳарбий ташкилотининг ва мамлакат мудофаа тизимининг негизи.',
                        'Ҳарбий можароларни жиловлаш ҳамда уларнинг олдини олиш.',
                        'Давлатнинг ҳарбий хавфсизлигини таъминлаш.'
                    )
                ),
                array(
                    'question' => 'Қуролли Кучлар таркибига нималар киради:',
                    'options' => array(
                        'Қуролли Кучлар таркибига Ўзбекистон Республикаси мудофаа, ички ишлар, фавқулодда вазиятлар вазирликларининг, Миллий гвардиясининг, Давлат хавфсизлик хизматининг, бошқа вазирликлар ва идораларнинг тегишли бошқарув органлари, қўшинлари, ҳарбий тузилмалари ва муассасалари киради.',
                        'Қуролли Кучлар таркибига фақат Ўзбекистон Республикаси Мудофаа вазирлиги бошқарув органлари, қўшинлари, ҳарбий тузилмалари ва муассасалари киради.',
                        'Қуролли Кучлар таркибига Ўзбекистон Республикаси мудофаа, ички ишлар, фавқулодда вазиятлар вазирликларининг бошқарув органлари, қўшинлари, ҳарбий тузилмалари ва муассасалари киради.',
                        'Қуролли Кучлар таркибига Ўзбекистон Республикаси мудофаа, ички ишлар, фавқулодда вазиятлар вазирликларининг, Миллий гвардиясининг, Давлат хавфсизлик хизматининг, бошқа вазирликлар ва идораларнинг тегишли бошқарув органлари ва қўшинлари киради.'
                    )
                ),
                array(
                    'question' => 'Ўзбекистон Республикаси Конституцияси нечта  бўлим, боб ва моддадан иборат?',
                    'options' => array(
                        '6 бўлим, 27 боб, 155 модда.',
                        '8 бўлим, 26 боб, 159 модда.',
                        '6 бўлим, 30 боб, 165 модда.',
                        '8 бўлим, 26 боб, 128 модда.'
                    )
                )
            ),
            array(
                array(
                    'question' => 'Ҳарбий можарога таъриф беринг.',
                    'options' => array(
                        'Давлатлар ўртасидаги ёки давлатнинг ички қарама-қаршиликларини ҳарбий куч қўллаган ҳолда ҳал этиш шакли бўлиб, бу қуролли кураш олиб боришнинг барча турларини, шу жумладан урушлар ва қуролли можароларни қамраб олади.',
                        'Давлатлар ўртасидаги қарама-қаршиликларини ҳарбий куч қўллаган ҳолда ҳал этиш шакли.',
                        'Давлатнинг ички қарама-қаршиликларини ҳарбий куч қўллаган ҳолда ҳал этиш шакли бўлиб, бу қуролли кураш олиб боришнинг барча турларини қамраб олади.',
                        'Давлатлар ўртасидаги ёки давлатнинг ички қарама-қаршиликларини ҳарбий куч қўллаган ҳолда ҳал этиш шакли бўлиб, урушлар ва қуролли можароларни қамраб олади.'
                    )
                ),
                array(
                    'question' => 'Ҳарбий тажовузга таъриф беринг.',
                    'options' => array(
                        'Ўзбекистон Республикасининг суверенитетига, ҳудудий яхлитлигига ва давлат мустақиллигига қарши ҳарбий кучни қўллаш.',
                        'Ўзбекистон Республикасининг дахлсизлигига қарши ҳарбий кучни қўллаш.',
                        'Ўзбекистон Республикасининг ички ва ташқи сиёсатига қарши ҳарбий кучни қўллаш.',
                        'Ўзбекистон Республикасининг тинч аҳолисига қарши ҳарбий кучни қўллаш.'
                    )
                ),
                array(
                    'question' => 'Ҳарбий хавфсизлик тушунчасига таъриф беринг?',
                    'options' => array(
                        'Ҳарбий хавфсизлик - миллий манфаатларнинг ҳарбий соҳада давлат хавфсизлигига бўлган таҳдидлардан ҳимояланганлик ҳолати.',
                        'Ҳарбий манфаатларнинг давлат хавфсизлигига бўлган таҳдидлардан ҳимояланганлик ҳолати.',
                        'Ҳарбий соҳада таҳдидлардан ҳимояланганлик ҳолати.',
                        'Тўғри жавоб берилмаган'
                    )
                ),
                array(
                    'question' => '“Ғоявий жангчига таъриф беринг”?',
                    'options' => array(
                        '“Ғоявий жангчи” – бу чинакам ватанпарвар, садоқатли, фидойи, ҳар қандай вазиятда қўйилган жанговар топшириқни қалқимасдан, иккиланмай бажаришга ҳам ахлоқан, ҳам руҳан тайёр бўлган ҳарбий хизматчидир.',
                        '“Ғоявий жангчи” – бу ватанпарвар, фидойи, қўйилган жанговар топшириқни қалқимасдан, иккиланмай бажаришга ҳам ахлоқан, ҳам руҳан тайёр бўлган ҳарбий хизматчидир.',
                        '“Ғоявий жангчи” – бу чинакам ватанпарвар, садоқатли, ҳар қандай вазиятда қўйилган жанговар топшириқни бажаришга ҳам ахлоқан, ҳам руҳан тайёр бўлган ҳарбий хизматчидир.',
                        '“Ғоявий жангчи” – бу садоқатли, фидойи, ҳар қандай вазиятда қўйилган жанговар топшириқни иккиланмай бажаришга ҳам ахлоқан, ҳам руҳан тайёр бўлган ҳарбий хизматчидир.'
                    )
                ),
                array(
                    'question' => 'Маънавий таҳдид деганда нимани тушунасиз?',
                    'options' => array(
                        'Маънавий таҳдид аввало, тили, дини, эътиқодидан қатъий назар, ҳар қайси одамнинг том маънодаги эркин инсон бўлиб яшашига қарши қаратилган, унинг айнан руҳий дунёсини издан чиқариш мақсадини кўзда тутадиган мафкуравий, ғоявий ва информацион хуружларни назарда тутиш лозим.',
                        'Маънавий таҳдид аввало дини, эътиқодидан қатъий назар, ҳар қайси одамнинг том маънодаги эркин инсон бўлиб яшашига қарши қаратилган, унинг айнан руҳий дунёсини издан чиқариш мақсадини кўзда тутадиган мафкуравий, ғоявий ва информацион хуружларни назарда тутиш лозим.',
                        'Маънавий таҳдид аввало, тили, дини, эътиқодидан қатъий назар, ҳар қайси одамнинг том маънодаги эркин инсон бўлиб яшашига қарши қаратилган, унинг жисмоний дунёсини издан чиқариш мақсадини кўзда тутадиган мафкуравий, ғоявий ва информацион хуружларни назарда тутиш лозим.',
                        'Маънавий таҳдид аввало, тили ва эътиқодидан қатъий назар, ҳар қайси одамнинг том маънодаги эркин инсон бўлиб яшашига қарши қаратилган, унинг айнан виртуал дунёсини издан чиқариш мақсадини кўзда тутадиган информацион хуружларни назарда тутиш лозим.'
                    )
                ),
            ),
            array(
                array(
                    'question' => 'Миллий манфаат деганда нимани тушунасиз?',
                    'options' => array(
                        'Давлатнинг энг муҳим мақсадалари, интилишлари ва эҳтиёжлари; давлат ва жамиятнинг мавжудлиги, ривожланиши учун бирламчи, устувор ва фундаментал аҳамиятга эга бўлган англаб етилган сиёсий, иқтисодий, ҳарбий ва бошқа эҳтиёжлари мажмуи.',
                        'Давлатнинг энг муҳим мақсадалари, интилишлари ва эҳтиёжлари мажмуи.',
                        'Давлат ва жамиятнинг мавжудлиги, ривожланиши учун бирламчи, устувор ва фундаментал аҳамиятга эга бўлган англаб етилган сиёсий, иқтисодий, ҳарбий ва бошқа эҳтиёжлари мажмуи.',
                        'Давлатнинг энг муҳим мақсадалари ва интилишлари; давлат ва жамиятнинг мавжудлиги, ривожланиши учун устувор ва фундаментал аҳамиятга эга бўлган англаб етилган сиёсий, ижтимоий, ҳарбий ва бошқа эҳтиёжлари мажмуи.'
                    )
                ),
                array(
                    'question' => 'Таҳлил деганда нимани тушунасиз?',
                    'options' => array(
                        'бир бутунни фикран ёки амалда таркибий қисмларга бўлишга асосланган илмий тадқиқот услуби.',
                        'бирор нарсани ўрганиш, таҳлил этиш.',
                        'а ва б жавоблари.',
                        'тўғри жавоб берилмаган.'
                    )
                ),
                array(
                    'question' => 'Ялпи ички маҳсулот тушунчасига таъриф беринг?',
                    'options' => array(
                        'Макроиқтисодий кўрсаткич ҳисобланиб, маълум бир даврда, одатда бир йил давомида мамлакат ҳудудида ишлаб чиқарилган барча якуний маҳсулот ва хизматларнинг бозор қиймати.',
                        'Маълум бир даврда, одатда бир йил давомида мамлакат ҳудудида ишлаб чиқарилган барча якуний маҳсулот ва хизматларнинг бозор қиймати.',
                        'Макроиқтисодий кўрсаткич ҳисобланиб, маълум бир даврда, одатда бир йил давомида мамлакат ҳудудида ишлаб чиқарилган барча якуний маҳсулотларнинг бозор қиймати.',
                        'Макроиқтисодий кўрсаткич ҳисобланиб, маълум бир даврда, одатда бир йил давомида мамлакат ҳудудида кўрсатилган барча хизматларнинг бозор қиймати.'
                    )
                ),
                array(
                    'question' => 'Мантиқ деганда нимани тушунасиз?',
                    'options' => array(
                        'Тўғри фикрлаш амалиёти ва қонунлари тўғрисидаги фан. Мантиқ – фикр юритиш, исботлаш, мулоҳаза қилиш ёки хулоса чиқариш манбаидир.',
                        'Тўғри фикрлаш амалиёти ва қонунлари тўғрисидаги фан.',
                        'Фикр юритиш, исботлаш, мулоҳаза қилиш ёки хулоса чиқариш манбаидир.',
                        'Тўғри фикрлаш қонунлари тўғрисидаги фан. Мантиқ – фикр юритиш ва мулоҳаза қилиш манбаидир.'
                    )
                ),
                array(
                    'question' => 'Ҳарбий интизом тушунчасига таъриф беринг.',
                    'options' => array(
                        'Барча ҳарбий хизматчиларнинг қонунчилик ҳужжатлари, ҳарбий низомлар ва командирларнинг (бошлиқларнинг) буйруқлари билан белгиланган тартиб ва қоидаларга қатъий ҳамда аниқ риоя этиши.',
                        'Барча ҳарбий хизматчиларнинг қонунчилик ҳужжатлари ва ҳарбий низомлар билан белгиланган тартиб ва қоидаларга қатъий ҳамда аниқ риоя этиши.',
                        'Барча ҳарбий хизматчиларнинг ҳарбий низомлар ва командирларнинг (бошлиқларнинг) буйруқлари билан белгиланган тартиб ва қоидаларга қатъий ҳамда аниқ риоя этиши.',
                        'Тўғри жавоб Ўзбекистон Республикаси Қуролли Кучларининг Интизом низомида келтирилган.'
                    )
                ),
            )
        );
        return view('students.tests.index', compact('tests'));
    }

    public function store(Request $request)
    {
        $request->validate([
            'answers' => ['required'],
            'answers.*' => ['required'],
            'answers.*.1' => ['required'],
            'answers.*.2' => ['required'],
            'answers.*.3' => ['required'],
            'answers.*.4' => ['required'],
            'answers.*.5' => ['required'],
        ]);

        $done_answers = [
            1 => [
                1 => 'A',
                2 => 'A',
                3 => 'A',
                4 => 'A',
                5 => 'A',
            ],
            2 => [
                1 => 'A',
                2 => 'A',
                3 => 'A',
                4 => 'A',
                5 => 'A',
            ],
            3 => [
                1 => 'A',
                2 => 'C',
                3 => 'A',
                4 => 'A',
                5 => 'A',
            ],
        ];

        $user_done_answers = 0;
        foreach($request->input('answers') as $subject_key => $subject){
            foreach($subject as $answer_key => $answer){
                if($done_answers[$subject_key][$answer_key] == $answer) $user_done_answers++;
            }
        }

        auth()->user()->update([
            'tests_points' => (float)$user_done_answers
        ]);

        return back()->with([
            'success' => true,
            'message' => 'Testni muvaffaqiyatli o\'tdingiz'
        ]);
    }
}
